# ProfileSymbol Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Sweep..::..ProfileSymbol Property
Sweep Class See Also
---
The family symbol profile details for the sweep.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilySymbolProfile ProfileSymbol { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProfileSymbol As FamilySymbolProfile
	Get
```

Visual C++
---
```text
public:
property FamilySymbolProfile^ ProfileSymbol {
	FamilySymbolProfile^ get ();
}
```

# Remarks
If the profile is not based on a profile family, this property is nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
Sweep Class
Autodesk.Revit.DB Namespace